<script setup>
import { ref } from 'vue'

const List = ref([
  {
    url: ['', '', '', '', ''],
    word: ['期末突击', '数学', '物理', '数据结构', '英语']
  },
  {
    url: ['', '', '', '', ''],
    word: ['计算机', '大数据与人工智能', '嵌入式科学', '计算机科学与技术', '软件工程']
  },
  {
    url: ['', '', '', '', ''],
    word: ['理学工学农学', '数学', '物理', '药学', '农业科技']
  },
  {
    url: ['', '', '', '', ''],
    word: ['外语', '听力', '写作', '口语', '翻译']
  },
  {
    url: ['', '', '', '', ''],
    word: ['考研', '数学', '英语', '政治', '408']
  },
  {
    url: ['', '', '', '', ''],
    word: ['四六级', '专四', '专八', '公开课', '六级']
  },
  {
    url: ['', '', '', '', ''],
    word: ['文史哲法', '汉语言', '法学', '新闻学', '历史学']
  },
  {
    url: ['', '', '', '', ''],
    word: ['艺术设计', '美术', '音乐', '舞蹈', '戏剧']
  },
  {
    url: ['', '', '', '', ''],
    word: ['体育健身', '游泳', '篮球', '足球', '羽毛球']
  },
  {
    url: ['', '', '', '', ''],
    word: ['金融经济', '会计学', '国际贸易', '经济学原理', '财政学']
  },
  {
    url: ['', '', '', '', ''],
    word: ['生物科学', '化学', '生物技术', '环境科学', '食品科学']
  }
])
</script>

<template>
  <div class='ClassList-body'>
    <div class='List-top'>
      <svg t='1720056112587' class='icon' viewBox='0 0 1024 1024' version='1.1' xmlns='http://www.w3.org/2000/svg'
           p-id='11375' style='width: 1.2vw; position:absolute; left: 0.8vw'>
        <path
          d='M503.11 527.14l-2.409 1.669c-1.112 14.455-1.853 28.724-3.335 43.179-2.039 21.867-7.598 42.993-18.161 62.637-12.973 24.091-34.655 39.102-58.746 50.962-25.944 12.972-42.252 31.319-44.476 60.413-2.224 30.022 7.042 55.225 32.245 73.571 23.35 17.235 50.777 22.794 79.872 21.868 46.33-1.483 80.798-22.794 94.697-67.456 10.007-32.245 8.34-64.49 1.668-96.92-9.08-44.291-25.76-85.802-54.113-121.94-7.968-10.006-17.976-18.53-27.241-27.982m320.413 69.309v39.287c-0.556 1.853-1.297 3.891-1.853 5.745-4.077 20.755-6.487 42.067-12.787 62.266-18.717 59.672-53.557 109.337-102.48 149.736-37.805 31.319-80.243 53.742-128.982 64.861-15.937 3.706-32.43 5.93-48.553 8.71H488.1c-2.038-0.556-4.076-1.483-6.115-1.668-42.437-2.41-83.948-13.528-122.124-32.245-72.273-35.58-124.533-88.582-148.254-164.747-5.003-16.308-7.227-33.357-10.748-50.036v-37.62c1.483-9.265 2.965-18.531 4.633-27.797 7.783-40.4 26.315-75.98 50.777-108.966 23.164-30.948 47.812-60.97 69.679-92.844 23.72-34.469 35.21-72.83 28.539-114.711-1.297-8.34-2.595-16.679-3.892-24.833 0.927-0.185 1.668-0.37 2.595-0.556 53 53.557 61.71 119.53 54.112 190.691 2.039-2.038 3.521-3.335 4.818-5.003 45.032-58.746 64.305-123.792 49.665-196.436-9.266-46.33-29.465-87.84-62.822-122.495-14.455-15.01-32.06-27.241-48.183-40.77h16.679c1.297 0.557 2.594 1.483 4.077 1.669 29.28 2.409 56.892 11.119 83.207 23.535 60.043 27.983 108.781 69.494 149.551 120.27 59.858 74.498 98.774 157.15 106.558 252.217a290.767 290.767 0 0 1-10.934 106.372c-3.706 13.157-9.08 25.944-14.084 39.657a103.44 103.44 0 0 0 45.588-35.951c33.913-47.256 43.55-100.071 35.766-158.26 2.594 2.78 3.706 3.891 4.633 5.374 20.385 31.319 35.766 64.676 43.735 100.812 3.706 14.64 5.56 29.28 7.968 43.735'
          fill='#FF8637' p-id='11376'></path>
      </svg>
      <div class='word'>精品课程</div>
    </div>
    <div class='List-li' v-for='item in List' :key='item'>
      <span class='titleWord'>{{ item.word[0] }}</span>
      <span class='afterWord'>{{ item.word[1] }}/</span>
      <span class='afterWord'>{{ item.word[2] }}/</span>
      <span class='afterWord'>{{ item.word[3] }}/</span>
      <span class='afterWord'>{{ item.word[4] }}/</span>
    </div>
  </div>
</template>

<style scoped lang='scss'>
.ClassList-body {
  width: 100%;
  height: 100%;
  background: white;

  .List-li:first-child {
    margin-top: 0;
  }

  .List-li:hover {
    background-color: rgba(250, 217, 126, 0.3);
  }

  .List-li {
    width: 92%;
    height: 3.1vh;
    line-height: 3vh;
    padding-left: 1vw;
    font-size: 0.85vw;
    overflow: hidden;
    white-space: nowrap;
    transition: background-color 0.3s ease;
    text-overflow: ellipsis;

    .titleWord {
      transition: color 0.3s ease;
    }

    .titleWord:hover {
      cursor: pointer;
      text-decoration: underline;
      color: rgba(253, 122, 5);
    }

    .afterWord:hover {
      cursor: pointer;
      text-decoration: underline;
      color: rgba(253, 122, 5);
    }

    .afterWord {
      width: 10vw;
      font-size: 0.75vw;
      margin-left: 0.3vw;
      color: #727070;
      transition: color 0.3s ease;
    }
  }

  .List-top {
    width: 100%;
    height: 7%;
    font-size: 0.9vw;
    position: relative;

    .word {
      margin: 1vh 2.1vw;
    }
  }
}
</style>